In [1]:
import pandas as pd
import numpy as np

In [4]:
maasSozluk = {"Isim" : ["Atıl","Zeynep","Mehmet","Ahmet"],
             "Departman" : ["Yazılım","Satış","Pazarlama","Yazılım"],
             "Maas" : [200,300,400,500]
             }

In [5]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [6]:
maasDataFrame

     Isim  Departman  Maas
0    Atıl    Yazılım   200
1  Zeynep      Satış   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [7]:
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [8]:
maasDataFrame["Departman"].nunique()

3

In [9]:
maasDataFrame["Departman"].value_counts()

Yazılım      2
Satış        1
Pazarlama    1
Name: Departman, dtype: int64

In [13]:
def bruttenNete(maas):
    return maas * 0.66

In [14]:
maasDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [15]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [19]:
yeniBirVeri = {"Karakter Sınıfı" : ["South Park", "South Park", "Simpson","Simpson"],
              "Karakter Ismi": ["Cartman","Kenny","Homer","Bart"],
              "Karakter Yas" : [9,10,50,20]}

In [20]:
karakterDF = pd.DataFrame(yeniBirVeri)

In [21]:
karakterDF

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20

In [ ]:
karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter Sınıfı", "Ka"])